espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct.h
typedef struct {
    volatile ahb_dma_in_int_raw_chn_reg_t raw;
    volatile ahb_dma_in_int_st_chn_reg_t st;
    volatile ahb_dma_in_int_ena_chn_reg_t ena;
    volatile ahb_dma_in_int_clr_chn_reg_t clr;
} ahb_dma_in_int_chn_reg_t;

typedef struct {
    volatile ahb_dma_out_int_raw_chn_reg_t raw;
    volatile ahb_dma_out_int_st_chn_reg_t st;
    volatile ahb_dma_out_int_ena_chn_reg_t ena;
    volatile ahb_dma_out_int_clr_chn_reg_t clr;
} ahb_dma_out_int_chn_reg_t;

typedef struct {
    volatile ahb_dma_in_conf0_chn_reg_t in_conf0;
    volatile ahb_dma_in_conf1_chn_reg_t in_conf1;
    volatile ahb_dma_infifo_status_chn_reg_t infifo_status;
    volatile ahb_dma_in_pop_chn_reg_t in_pop;
    volatile ahb_dma_in_link_chn_reg_t in_link;
    volatile ahb_dma_in_state_chn_reg_t in_state;
    volatile ahb_dma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr;
    volatile ahb_dma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr;
    volatile ahb_dma_in_dscr_chn_reg_t in_dscr;
    volatile ahb_dma_in_dscr_bf0_chn_reg_t in_dscr_bf0;
    volatile ahb_dma_in_dscr_bf1_chn_reg_t in_dscr_bf1;
    volatile ahb_dma_in_pri_chn_reg_t in_pri;
    volatile ahb_dma_in_peri_sel_chn_reg_t in_peri_sel;
} ahb_dma_in_chn_reg_t;

typedef struct {
    volatile ahb_dma_out_conf0_chn_reg_t out_conf0;
    volatile ahb_dma_out_conf1_chn_reg_t out_conf1;
    volatile ahb_dma_outfifo_status_chn_reg_t outfifo_status;
    volatile ahb_dma_out_push_chn_reg_t out_push;
    volatile ahb_dma_out_link_chn_reg_t out_link;
    volatile ahb_dma_out_state_chn_reg_t out_state;
    volatile ahb_dma_out_eof_des_addr_chn_reg_t out_eof_des_addr;
    volatile ahb_dma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr;
    volatile ahb_dma_out_dscr_chn_reg_t out_dscr;
    volatile ahb_dma_out_dscr_bf0_chn_reg_t out_dscr_bf0;
    volatile ahb_dma_out_dscr_bf1_chn_reg_t out_dscr_bf1;
    volatile ahb_dma_out_pri_chn_reg_t out_pri;
    volatile ahb_dma_out_peri_sel_chn_reg_t out_peri_sel;
} ahb_dma_out_chn_reg_t;

typedef struct {
    volatile ahb_dma_in_chn_reg_t in;
    uint32_t reserved_in[11];
    volatile ahb_dma_out_chn_reg_t out;
    uint32_t reserved_out[11];
} ahb_dma_chn_reg_t;

typedef struct {
    uint32_t reserved[8];
    ahb_dma_rx_ch_arb_weight_chn_reg_t ch_arb_weight;
    ahb_dma_rx_arb_weight_opt_dis_chn_reg_t arb_weight_opt;
} ahb_dma_in_crc_arb_chn_reg_t;

typedef struct {
    uint32_t reserved[8];
    ahb_dma_tx_ch_arb_weight_chn_reg_t ch_arb_weight;
    ahb_dma_tx_arb_weight_opt_dis_chn_reg_t arb_weight_opt;
} ahb_dma_out_crc_arb_chn_reg_t;

typedef struct {
    ahb_dma_in_done_des_addr_chn_reg_t in_done_des_addr;
    ahb_dma_out_done_des_addr_chn_reg_t out_done_des_addr;
} ahb_dma_done_des_addr_chn_reg_t;

typedef struct {
    volatile ahb_dma_in_int_chn_reg_t in_intr[3];
    volatile ahb_dma_out_int_chn_reg_t out_intr[3];
    volatile ahb_dma_ahb_test_reg_t ahb_test;
    volatile ahb_dma_misc_conf_reg_t misc_conf;
    volatile ahb_dma_date_reg_t date;
    uint32_t reserved_06c;
    volatile ahb_dma_chn_reg_t channel[3];
    uint32_t reserved_2b0[3];
    volatile ahb_dma_out_crc_arb_chn_reg_t out_crc_arb[3];
    volatile ahb_dma_in_crc_arb_chn_reg_t in_crc_arb[3];
    volatile ahb_dma_in_link_addr_chn_reg_t in_link_addr[3];
    volatile ahb_dma_out_link_addr_chn_reg_t out_link_addr[3];
    volatile ahb_dma_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile ahb_dma_intr_mem_end_addr_reg_t intr_mem_end_addr;
    uint32_t reserved_3cc[4];
    volatile ahb_dma_arb_timeout_reg_t arb_timeout;
    uint32_t reserved_3e0[8];
    volatile ahb_dma_weight_en_reg_t weight_en;
    volatile ahb_dma_module_clk_en_reg_t module_clk_en;
    volatile ahb_dma_ahbinf_resp_err_status0_reg_t ahbinf_resp_err_status0;
    volatile ahb_dma_ahbinf_resp_err_status1_reg_t ahbinf_resp_err_status1;
    volatile ahb_dma_done_des_addr_chn_reg_t done_des_addr[3];
} ahb_dma_dev_t;

extern ahb_dma_dev_t AHB_DMA;

#ifndef __cplusplus
_Static_assert(sizeof(ahb_dma_dev_t) == 0x428, "Invalid size of ahb_dma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
